; domain
(define (domain furniture-assembly)
	(:requirements :strips :typing)
	(:types
		tool tool-part - object
		table-top table-leg chair-base chair-leg chair-seat shelf-frame shelf-box desk-plane desk-drawer - tool
		handle-part action-part - tool-part
		gripper
	)

	(:predicates
		(on ?t1 - tool ?t2 - tool)
		(on-floor ?t - tool)
		(clear ?t - tool)
		(empty ?g - gripper)
		(in-hand ?g - gripper ?t - tool)
		(screwed-into ?t - tool ?s - tool)
        (connected-to ?t - tool ?s - tool)
		(part-of ?tp - tool-part ?t - tool)
		(affords-picking ?tp - handle-part)
		(affords-screwing ?tp - action-part)
        (affords-connecting ?tp - action-part)
		(affords-hammering ?tp - action-part)
		(affords-turning-on ?tp - action-part)
		(affords-turning-off ?tp - action-part)
		(affords-placing ?t - tool)
		(affords-screwing-into ?s - tool ?tp - tool-part ?t - tool)
        (affords-connecting-to ?s - tool ?tp - tool-part ?t - tool)
	)

	(:action pick-up-from-tool
		:parameters (?g - gripper ?tp - handle-part ?t - tool ?s - tool)
		:precondition (and (clear ?t) (empty ?g) (on ?t ?s) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (clear ?s) (not (clear ?t)) (not (empty ?g)) (not (on ?t ?s)))
	)

	(:action pick-up-from-floor
		:parameters (?g - gripper ?tp - handle-part ?t - tool)
		:precondition (and (clear ?t) (empty ?g) (on-floor ?t) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (not (clear ?t)) (not (empty ?g)) (not (on-floor ?t)))
	)

	(:action put-on-floor
		:parameters (?g - gripper ?t - tool)
		:precondition (and (in-hand ?g ?t) (affords-placing ?t))
		:effect (and (on-floor ?t) (clear ?t) (empty ?g) (not (in-hand ?g ?t)))
	)

	(:action screw-into
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-screwing ?tp) (part-of ?th ?tt) (affords-screwing-into ?tl ?th ?tt))
		:effect (and (screwed-into ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)

    (:action connect-to
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-connecting ?tp) (part-of ?th ?tt) (affords-connecting-to ?tl ?th ?tt))
		:effect (and (connected-to ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)
)

; problem
(define (problem table-assembly-full)
	(:domain furniture-assembly)

	(:objects
		table-leg1 table-leg2 table-leg3 table-leg4 - table-leg
		table-klubbo-top - table-top
		table-leg1-base table-leg2-base table-leg3-base table-leg4-base - handle-part
		table-leg1-connect table-leg2-connect table-leg3-connect table-leg4-connect - action-part
		table-klubbo-top-connector1 table-klubbo-top-connector2 table-klubbo-top-connector3 table-klubbo-top-connector4 - tool-part
		robot-gripper - gripper
	)

	(:init
		(on-floor table-leg1)
		(on-floor table-leg2)
		(on-floor table-leg3)
		(on-floor table-leg4)
		(on-floor table-klubbo-top)

		(clear table-leg1)
		(clear table-leg2)
		(clear table-leg3)
		(clear table-leg4)

		(empty robot-gripper)

		(part-of table-leg1-base table-leg1)
		(part-of table-leg1-connect table-leg1)
		(part-of table-leg2-base table-leg2)
		(part-of table-leg2-connect table-leg2)
		(part-of table-leg3-base table-leg3)
		(part-of table-leg3-connect table-leg3)
		(part-of table-leg4-base table-leg4)
		(part-of table-leg4-connect table-leg4)
		(part-of table-klubbo-top-connector1 table-klubbo-top)
		(part-of table-klubbo-top-connector2 table-klubbo-top)
		(part-of table-klubbo-top-connector3 table-klubbo-top)
		(part-of table-klubbo-top-connector4 table-klubbo-top)

		(affords-picking table-leg1-base)
		(affords-picking table-leg2-base)
		(affords-picking table-leg3-base)
		(affords-picking table-leg4-base)
		(affords-connecting table-leg1-connect)
		(affords-connecting table-leg2-connect)
		(affords-connecting table-leg3-connect)
		(affords-connecting table-leg4-connect)
		(affords-connecting-to table-leg1 table-klubbo-top-connector1 table-klubbo-top)
		(affords-connecting-to table-leg2 table-klubbo-top-connector2 table-klubbo-top)
		(affords-connecting-to table-leg3 table-klubbo-top-connector3 table-klubbo-top)
		(affords-connecting-to table-leg4 table-klubbo-top-connector4 table-klubbo-top)
	)

	(:goal (and (connected-to table-leg1 table-klubbo-top)
				(connected-to table-leg2 table-klubbo-top)
				(connected-to table-leg3 table-klubbo-top)
				(connected-to table-leg4 table-klubbo-top)
		   	)
	)
)

; plan
1. (pick-up-from-floor robot-gripper table-leg4-base table-leg4)
   deleted: (clear table-leg4) (empty robot-gripper) (on-floor table-leg4)
   added: (in-hand robot-gripper table-leg4)
   goals met: 0 of 4
2. (connect-to robot-gripper table-leg4-connect table-leg4 table-klubbo-top-connector4 table-klubbo-top)
   deleted: (in-hand robot-gripper table-leg4)
   added: (connected-to table-leg4 table-klubbo-top) (clear table-leg4) (empty robot-gripper)
   goals met: 1 of 4
3. (pick-up-from-floor robot-gripper table-leg1-base table-leg1)
   deleted: (clear table-leg1) (empty robot-gripper) (on-floor table-leg1)
   added: (in-hand robot-gripper table-leg1)
   goals met: 1 of 4
4. (connect-to robot-gripper table-leg1-connect table-leg1 table-klubbo-top-connector1 table-klubbo-top)
   deleted: (in-hand robot-gripper table-leg1)
   added: (connected-to table-leg1 table-klubbo-top) (clear table-leg1) (empty robot-gripper)
   goals met: 2 of 4
5. (pick-up-from-floor robot-gripper table-leg2-base table-leg2)
   deleted: (clear table-leg2) (empty robot-gripper) (on-floor table-leg2)
   added: (in-hand robot-gripper table-leg2)
   goals met: 2 of 4
6. (connect-to robot-gripper table-leg2-connect table-leg2 table-klubbo-top-connector2 table-klubbo-top)
   deleted: (in-hand robot-gripper table-leg2)
   added: (connected-to table-leg2 table-klubbo-top) (clear table-leg2) (empty robot-gripper)
   goals met: 3 of 4
7. (pick-up-from-floor robot-gripper table-leg3-base table-leg3)
   deleted: (clear table-leg3) (empty robot-gripper) (on-floor table-leg3)
   added: (in-hand robot-gripper table-leg3)
   goals met: 3 of 4
8. (connect-to robot-gripper table-leg3-connect table-leg3 table-klubbo-top-connector3 table-klubbo-top)
   deleted: (in-hand robot-gripper table-leg3)
   added: (connected-to table-leg3 table-klubbo-top) (clear table-leg3) (empty robot-gripper)
   goals met: 4 of 4
